package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/


public class Solution
{
    public static void main(String[] args)
    {
        //Date d = new Date();
        //SimpleDateFormat format1 = new SimpleDateFormat("dd mm yyyy");
        //System.out.println(format1.format(d));
        System.out.println("12" + " " + "05" + " " + "2016");

    }
}
